exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/wifi/esp_wifi_adapter.c
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 *
 *  Copyright (C) 2026 by Embedded and Real-Time Systems Laboratory
 *              Graduate School of Information Science, Nagoya Univ., JAPAN
 *
 *  上記著作権者は，本ソフトウェアをTOPPERSライセンス（条件は他のソー
 *  スファイルの先頭コメントを参照）の下で利用することを許諾する．本ソ
 *  フトウェアは無保証で提供される．
 */

/*
 *  Wi-Fi os_adapter（wifi_osi_funcs_t）のASP3実装（ESP32-C5版）
 *
 *  esp32c6版（asp3_target/esp32c6_espidf/wifi/esp_wifi_adapter.c）から
 *  のコピー・C5対応（docs/c5-port-design.md §5.4）。設計テンプレートは
 *  NuttXのesp_wifi_adapter.c（apache/nuttx
 *  arch/risc-v/src/esp32c3/esp_wifi_adapter.c）で，osi関数をshim基盤
 *  （esp_shim.[ch]）で実装したもの．NuttXと同じくevent group・NVSは
 *  未実装（スタブ）．設計はdocs/wifi-shim.md．
 *
 *  ■ C6からの変更点（本ファイルの書き換え量が最大．docs/c5-port-design.md
 *    §5.4・§9参照）
 *   1. 割込み関連（下記「割込み関連」節）：C6独自"PLIC_MX"方式
 *      （メモリマップトレジスタ配列＝ENABLE/TYPE/PRI）を，標準RISC-V
 *      CLIC方式（CLIC_INT_CTRL_REG(i)のIE/ATTR/CTLバイト操作．
 *      arch/riscv_gcc/esp32c5/clic_kernel_impl.hと同じ規約）へ全面
 *      書き換えた。同ヘッダはカーネル内部専用（他ファイルからinclude
 *      禁止と明記）のため，本ファイルでは同じ規約を独立に定義している
 *      （二重定義ではなく意図的な並行定義）。
 *   2. MODEM_SYSCON：C6の0x600A9800から**0x600A9C00へ移動**
 *      （esp_shim_modem_icg_init参照．+0x400移動．C6の値を転記せず
 *      soc/esp32c5/include/modem/reg_base.hで個別に確認済み）。
 *      MODEM_LPCON（0x600AF000）・PMU（0x600B0000）・LP_AON（0x600B1000）
 *      はC6と同一（soc/esp32c5/include/modem/reg_base.h・
 *      soc/esp32c5/register/soc/reg_base.h・
 *      soc/esp32c5/register/soc/lp_aon_reg.hで確認済み）。
 *   3. wifi_clock_enable_wrapper/phy_enable_wrapperのWIFIPWRクロック
 *      ドメイン有効化（MODEM_LPCON_CLK_CONF_REG＝0x600af018のbit0-2）は
 *      C6の根本原因修正のうちレジスタ名・オフセットともC5でも完全に
 *      同一と確認できたためそのまま移植した（soc/esp32c5/include/
 *      modem/modem_lpcon_reg.hで確認）。一方，C6版が広域JTAG diffで
 *      追加していた0x600af008／0x600af048への書込みは，前者は「検証の
 *      ため」と明記された未確定の補助措置，後者はC5では
 *      MODEM_LPCON_DCMEM_VALID_3_REG（DCMEM有効性ビットマップ．LP
 *      クロックとは無関係な別レジスタ）に相当し，C6の値をそのまま
 *      書き込むのは意味的に誤りうるため，本ポートでは移植せず削除した
 *      （下記phy_enable_wrapper・wifi_clock_enable_wrapperのコメント
 *      参照）。
 *   4. C6専用のGROUND-TRUTH比較用RTCカウンタ（GT_SEMTAKE等）・
 *      phy_enable_wrapper内のRTC診断マーカ（0x50000080/0x50000084）は
 *      C6のAGC/deaf-RX調査専用の一時計装のため移植しない
 *      （docs/c5-port-design.md §8.3「C6資産の非移植方針」）。
 */

#include <kernel.h>
#include <t_syslog.h>
#include <string.h>
#include <stdio.h>
#include <sil.h>
#include "esp_shim.h"
#include "esp_shim_cfg.h"
#include "esp32c5.h"		/* ESP32C5_INTMTX_BASE／ESP32C5_CLIC_CTRL_BASE等
							   （CHIPDIRがASP3_INCLUDE_DIRSに含まれるため
							   到達可能．arch/riscv_gcc/esp32c5/chip.cmake参照） */

#include "esp_attr.h"
#include "esp_private/wifi_os_adapter.h"
#include "esp_private/wifi.h"
#include "private/esp_coexist_adapter.h"
#include "soc/periph_defs.h"
#include "esp_private/esp_modem_clock.h"
#include "hal/regi2c_ctrl_ll.h"
#include "hal/modem_lpcon_ll.h"
#include "hal/modem_syscon_ll.h"
#include "hal/pmu_ll.h"
#include "esp_rom_sys.h"	/* esp_rom_delay_us（esp_shim_pvt_init用） */

/*
 *  リンク閉包で解決するesp-hal／blob側の関数（宣言のみ）
 *
 *  C6はmodem_clockサブシステムを持ち（SOC_MODEM_CLOCK_IS_INDEPENDENT），
 *  WIFI/BT等モジュールのreset/enableはmodem_clock_module_*系を使う．
 *  periph_module_reset()（clk_gate_ll.hのTIMG0/TIMG1/UHCI0/SYSTIMER
 *  4種のみを扱う旧shared_periph_module_tテーブル）はWIFI(=4)に対して
 *  範囲外アクセスとなり，GCCが到達不能と判断してebreakを生成する
 *  （実機JTAG調査で確定．periph_ctrl.cのperiph_ll_reset参照）．
 *  C3のesp_wifi_adapter.cはこの区別がないチップ向けの実装で，本ファイルは
 *  そこからの流用時にこの差を見落としていた．
 */
extern void esp_phy_enable(int modem);
extern void esp_phy_disable(int modem);
extern void phy_wifi_enable_set(uint8_t enable);
extern int esp_phy_update_country_info(const char *country);
extern void wifi_module_enable(void);
extern void wifi_module_disable(void);
extern int esp_read_mac(uint8_t *mac, int type);

#ifndef PHY_MODEM_WIFI
#define PHY_MODEM_WIFI      1
#endif

/*
 *		割込み関連
 */
/*
 *  ESP32-C5は標準RISC-V CLICを採用する（C6独自の"PLIC_MX"方式とは
 *  アーキテクチャレベルで異なる．docs/c5-port-design.md §3・§4・§8.2，
 *  arch/riscv_gcc/esp32c5/clic_kernel_impl.h冒頭コメント参照）。
 *
 *  ソースルーティング（INTMTX．ペリフェラル割込みソース→CPU割込み線）
 *  自体はC6・C3と同一アドレス・同一方式のまま存続する
 *  （soc/esp32c5/register/soc/reg_base.hでDR_REG_INTMTX_BASE=0x60010000
 *  がC6と同一値であることを確認済み）。
 *
 *  CPU割込み線側の制御（C6はENABLE/TYPE/PRIの独立したメモリマップト
 *  レジスタ配列＝PLIC_MX）は，標準RISC-V CLICのCLIC_INT_CTRL_REG(i)
 *  （1ワードにIP/IE/ATTR(TRIG/SHV/MODE)/CTL(優先度)をバイト単位で
 *  格納．soc/esp32c5/include/soc/clic_reg.h）へ全面書き換えた。
 *  ここで使う規約（CLIC内部番号=ASP3 INTNO+16・NLBITS=3・ATTRバイトの
 *  MODE/TRIG/SHVビット位置）はarch/riscv_gcc/esp32c5/clic_kernel_impl.h
 *  （フェーズ2aでCLIC対応の基盤として実装済み）と完全に同じ規約だが，
 *  同ヘッダはカーネル内部専用（ファイル冒頭に「他のファイルから直接
 *  インクルードしてはならない」と明記）のため，本ファイルでは同じ
 *  規約を独立に（ローカルマクロとして）定義する。
 */
#define INTMTX_BASE_ADDR       ESP32C5_INTMTX_BASE      /* 0x60010000．ソースルーティング（C6・C3と同一．変更なし） */
#define CLIC_CTRL_BASE_ADDR    ESP32C5_CLIC_CTRL_BASE    /* 0x20801000．CPU割込み線制御（CLIC_INT_CTRL_REG(i)=BASE+4i） */
#define CLIC_EXT_OFFSET        16U                       /* ASP3 INTNO(1〜31)→CLIC内部番号(17〜47)のオフセット */
#define CLIC_LINE(intno)       ((uint32_t)(intno) + CLIC_EXT_OFFSET)
#define CLIC_IE_OFF(line)      (CLIC_CTRL_BASE_ADDR + (line) * 4U + 1U)  /* 許可（1byte） */
#define CLIC_ATTR_OFF(line)    (CLIC_CTRL_BASE_ADDR + (line) * 4U + 2U)  /* SHV/TRIG/MODE（1byte） */
#define CLIC_CTL_OFF(line)     (CLIC_CTRL_BASE_ADDR + (line) * 4U + 3U)  /* 優先度（1byte，上位3bit=NLBITSが実効） */

/*
 *  ATTRバイト＝MODE(bit[7:6])<<6 | TRIG(bit[2:1])<<1 | SHV(bit0)．
 *  MODE=3(machine)・TRIG=0(level)・SHV=0(非ベクタド)＝0xC0
 *  （soc/esp32c5/include/soc/clic_reg.hのBYTE_CLIC_INT_ATTR_*ビット
 *  位置で確認．clic_kernel_impl.hのCLIC_ATTR_MODE_MACHINEと同じ値）。
 */
#define CLIC_ATTR_LEVEL_MACHINE   UINT_C(0xC0)

/*
 *  優先度→CTLバイト変換（NLBITS=3．clic_kernel_impl.hのCLIC_NLBITS_TO_BYTE
 *  と同じ規約．上位3bitが実効優先度，下位5bitは1で埋める）。
 */
#define CLIC_NLBITS_SHIFT      5U
#define CLIC_PRIO_TO_CTL(pri) \
	(((uint32_t)(pri) << CLIC_NLBITS_SHIFT) | ((1U << CLIC_NLBITS_SHIFT) - 1U))

static void
set_intr_wrapper(int32_t cpu_no, uint32_t intr_source, uint32_t intr_num,
				 int32_t intr_prio)
{
	uint32_t	line = CLIC_LINE(intr_num);

