exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/wifi/esp_wifi_adapter.c
	syslog(LOG_NOTICE, "wifi_adapter: set_intr src=%d intno=%d prio=%d",
		   (int_t)intr_source, (int_t)intr_num, (int_t)intr_prio);
	/*
	 *  ソースルーティング（INTMTX＝ソース→CPU割込み線）と優先度
	 *  （CLIC_INT_CTRL_REG(i)のCTLバイト）．blobが使う線はカーネル
	 *  管理外扱い（cfgのDEF_INHは共通ディスパッチャ＝esp_shim.cfg参照）
	 *  のため直接レジスタを操作する．優先度はblobの指定に関わらず
	 *  内部表現2（外部-2）に固定する（C6・C3のset_intr_wrapperと
	 *  同じ方針）．
	 *
	 *  ATTRバイトを明示的にLEVEL型・machineモード・非ベクタドへ設定
	 *  する。chip_initialize()のclic_initialize()（arch/riscv_gcc/
	 *  esp32c5/chip_kernel_impl.c）が起動時に全CLIC外部割込み線へ同じ
	 *  値を設定済みだが，C6の実機調査で「WiFi MAC割込み線のLEVEL型
	 *  未設定」が実バグだったという教訓（docs/wifi-shim-c6.md）を
	 *  踏まえ，blobが動的にset_intrを呼ぶたびにここでも不変条件として
	 *  明示的に保証する（起動時設定と同値のため冪等・無害）。WiFi MAC
	 *  割込みはinterrupts.hで"level"型と明記されており，CPU側がEDGE型
	 *  のままだと，レベルで張り続ける信号を取りこぼす（最初の一度も
	 *  含めて）おそれがある。
	 */
	/*
	 *  【C5実機で確定・実施02/実施04】INTMTXのMAP値は«CLIC内部線番号»
	 *  そのもの（＝CLIC_LINE(intr_num)＝intr_num+16）を書く．C6/C3のように
	 *  生のintr_numを書くと，CLIC側（下のCTL/ATTR）とカーネルのハンドラ登録は
	 *  line=CLIC_LINE(intr_num)で待っているのに，割込みは未許可の線intr_numへ
	 *  配送され一切届かない（WiFi MAC割込みが来ずesp_wifi_initがpp_create_task
	 *  のポーリング待ちでハングする実バグの原因．docs/c5-bringup.md実施04-05）．
	 */
	sil_wrw_mem((void *)(INTMTX_BASE_ADDR + intr_source * 4U), line);
	sil_wrb_mem((void *)CLIC_CTL_OFF(line), (uint8_t)CLIC_PRIO_TO_CTL(2U));
	sil_wrb_mem((void *)CLIC_ATTR_OFF(line), (uint8_t)CLIC_ATTR_LEVEL_MACHINE);
	(void) cpu_no;
	(void) intr_prio;
}

static void
clear_intr_wrapper(uint32_t intr_source, uint32_t intr_num)
{
	sil_wrw_mem((void *)(INTMTX_BASE_ADDR + intr_source * 4U), 0U);
	(void) intr_num;
}

static void
set_isr_wrapper(int32_t n, void *f, void *arg)
{
	esp_shim_set_isr(n, f, arg);
}

/*
 *  C6のPLICMX_ENABLE_REGは1本のビットマスクレジスタ（bit n＝CPU割込み
 *  線nの許可）だったが，CLICはCLIC_INT_CTRL_REG(i)のIEバイトが線ごとに
 *  独立しているため単一のビットマスクレジスタが存在しない．blobから
 *  渡される mask のビットnを「CPU割込み線n（＝ASP3のASP3擬似INTNO）の
 *  許可/禁止」として1本ずつCLICのIEバイトへ反映する（意味的には
 *  C6版と同じ効果）．
 */
static void
ints_on_wrapper(uint32_t mask)
{
	uint32_t	lock = esp_shim_int_disable();
	uint32_t	n;

	for (n = 0U; n < 32U; n++) {
		if ((mask & (1UL << n)) != 0U) {
			sil_wrb_mem((void *)CLIC_IE_OFF(CLIC_LINE(n)), 1U);
		}
	}
	esp_shim_int_restore(lock);
}

static void
ints_off_wrapper(uint32_t mask)
{
	uint32_t	lock = esp_shim_int_disable();
	uint32_t	n;

	for (n = 0U; n < 32U; n++) {
		if ((mask & (1UL << n)) != 0U) {
			sil_wrb_mem((void *)CLIC_IE_OFF(CLIC_LINE(n)), 0U);
		}
	}
	esp_shim_int_restore(lock);
}

static bool
is_from_isr_wrapper(void)
{
	return(sns_ctx());
}

/*
 *		環境・スピンロック（シングルコアのため割込み禁止で代用）
 */
static bool
env_is_chip_wrapper(void)
{
	return(true);	/* 実チップ（QEMUでもWi-Fiは動かないためtrue固定） */
}

static void *
spin_lock_create_wrapper(void)
{
	return((void *)1);	/* シングルコア：実体不要（非NULLを返す） */
}

static void
spin_lock_delete_wrapper(void *lock)
{
	(void) lock;
}

static uint32_t IRAM_ATTR
wifi_int_disable_wrapper(void *wifi_int_mux)
{
	(void) wifi_int_mux;
	return(esp_shim_int_disable());
}

static void IRAM_ATTR
wifi_int_restore_wrapper(void *wifi_int_mux, uint32_t tmp)
{
	(void) wifi_int_mux;
	esp_shim_int_restore(tmp);
}

static void IRAM_ATTR
task_yield_from_isr_wrapper(void)
{
	/* ASP3では割込み出口でディスパッチされるため何もしない */
}

/*
 *		セマフォ・ミューテックス
 */
static void *
semphr_create_wrapper(uint32_t max, uint32_t init)
{
	return(esp_shim_sem_create(max, init));
}

static void
semphr_delete_wrapper(void *semphr)
{
	esp_shim_sem_delete(semphr);
}

static int32_t
semphr_take_wrapper(void *semphr, uint32_t block_time_tick)
{
	return(esp_shim_sem_take(semphr, block_time_tick));
}

static int32_t
semphr_give_wrapper(void *semphr)
{
	return(esp_shim_sem_give(semphr));
}

extern void *esp_shim_thread_semphr_get(void);

static void *
mutex_create_wrapper(void)
{
	return(esp_shim_mutex_create(false));
}

static void *
recursive_mutex_create_wrapper(void)
{
	return(esp_shim_mutex_create(true));
}

static void
mutex_delete_wrapper(void *mutex)
{
	esp_shim_mutex_delete(mutex);
}

static int32_t
mutex_lock_wrapper(void *mutex)
{
	return(esp_shim_mutex_lock(mutex));
}

static int32_t
mutex_unlock_wrapper(void *mutex)
{
	return(esp_shim_mutex_unlock(mutex));
}

/*
 *		キュー
 */
static void *
queue_create_wrapper(uint32_t queue_len, uint32_t item_size)
{
	return(esp_shim_queue_create(queue_len, item_size));
}

static void
queue_delete_wrapper(void *queue)
{
	esp_shim_queue_delete(queue);
}

static int32_t
queue_send_wrapper(void *queue, void *item, uint32_t block_time_tick)
{
	return(esp_shim_queue_send(queue, item, block_time_tick, false));
}

static int32_t IRAM_ATTR
queue_send_from_isr_wrapper(void *queue, void *item, void *hptw)
{
	if (hptw != NULL) {
		*(int *)hptw = 0;	/* higher priority task woken：ASP3では不要 */
	}
	return(esp_shim_queue_send_from_isr(queue, item));
}

static int32_t
queue_send_to_back_wrapper(void *queue, void *item, uint32_t block_time_tick)
{
	return(esp_shim_queue_send(queue, item, block_time_tick, false));
}

static int32_t
queue_send_to_front_wrapper(void *queue, void *item, uint32_t block_time_tick)
{
	return(esp_shim_queue_send(queue, item, block_time_tick, true));
}

static int32_t
queue_recv_wrapper(void *queue, void *item, uint32_t block_time_tick)
{
	return(esp_shim_queue_recv(queue, item, block_time_tick));
}

static uint32_t
queue_msg_waiting_wrapper(void *queue)
{
	return(esp_shim_queue_msg_waiting(queue));
}

static void *
wifi_create_queue_wrapper(int queue_len, int item_size)
{
	/*
	 *  blobはwifi_static_queue_t（{handle,storage}）形式を期待する
	 *  （NuttX実装と同じ）
	 */
	wifi_static_queue_t	*wq;

	wq = (wifi_static_queue_t *)esp_shim_calloc(1U,
												sizeof(wifi_static_queue_t));
	if (wq == NULL) {
		return(NULL);
	}
	wq->handle = esp_shim_queue_create((uint32_t)queue_len,
									   (uint32_t)item_size);
	if (wq->handle == NULL) {
		esp_shim_free(wq);
		return(NULL);
	}
	return(wq);
}

static void
wifi_delete_queue_wrapper(void *queue)
{
	wifi_static_queue_t	*wq = (wifi_static_queue_t *)queue;

	if (wq != NULL) {
		esp_shim_queue_delete(wq->handle);
		esp_shim_free(wq);
	}
}

/*
 *		event group（NuttXと同じく未実装：blobは通常経路では使わない）
 */
static void *
event_group_create_wrapper(void)
{
	syslog(LOG_ERROR, "wifi_adapter: event_group not supported");
	return(NULL);
}

static void
event_group_delete_wrapper(void *event)
{
	(void) event;
}

static uint32_t
event_group_set_bits_wrapper(void *event, uint32_t bits)
{
	(void) event;
	return(bits);
}

static uint32_t
event_group_clear_bits_wrapper(void *event, uint32_t bits)
{
	(void) event;
	return(bits);
}

static uint32_t
event_group_wait_bits_wrapper(void *event, uint32_t bits_to_wait_for,
							  int clear_on_exit, int wait_for_all_bits,
							  uint32_t block_time_tick)
{
	(void) event; (void) bits_to_wait_for; (void) clear_on_exit;
	(void) wait_for_all_bits; (void) block_time_tick;
	return(0U);
}

