exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/wifi/esp_wifi_adapter.c
/*
 *		タスク
 */
static int32_t
task_create_wrapper(void *task_func, const char *name, uint32_t stack_depth,
					void *param, uint32_t prio, void *task_handle)
{
	return(esp_shim_task_create((void (*)(void *))task_func, name,
								stack_depth, param, prio,
								(void **)task_handle));
}

static int32_t
task_create_pinned_to_core_wrapper(void *task_func, const char *name,
								   uint32_t stack_depth, void *param,
								   uint32_t prio, void *task_handle,
								   uint32_t core_id)
{
	(void) core_id;		/* シングルコア */
	return(esp_shim_task_create((void (*)(void *))task_func, name,
								stack_depth, param, prio,
								(void **)task_handle));
}

static void
task_delete_wrapper(void *task_handle)
{
	esp_shim_task_delete(task_handle);
}

static void
task_delay_wrapper(uint32_t tick)
{
	esp_shim_task_delay(tick);
}

static int32_t
task_ms_to_tick_wrapper(uint32_t ms)
{
	return((int32_t)ms);	/* tick＝1ms */
}

static void *
task_get_current_task_wrapper(void)
{
	return(esp_shim_task_get_current());
}

static int32_t
task_get_max_priority_wrapper(void)
{
	return(25);		/* FreeRTOS互換の見かけの値（実際の写像はshim内） */
}

/*
 *		メモリ（全系統をshimヒープへ一本化）
 */
static void *
malloc_wrapper(size_t size)
{
	return(esp_shim_malloc(size));
}

static void
free_wrapper(void *p)
{
	esp_shim_free(p);
}

static void *
malloc_internal_wrapper(size_t size)
{
	return(esp_shim_malloc(size));
}

static void *
realloc_internal_wrapper(void *ptr, size_t size)
{
	return(esp_shim_realloc(ptr, size));
}

static void *
calloc_internal_wrapper(size_t n, size_t size)
{
	return(esp_shim_calloc(n, size));
}

static void *
zalloc_internal_wrapper(size_t size)
{
	return(esp_shim_calloc(1U, size));
}

static void *
wifi_malloc_wrapper(size_t size)
{
	return(esp_shim_malloc(size));
}

static void *
wifi_realloc_wrapper(void *ptr, size_t size)
{
	return(esp_shim_realloc(ptr, size));
}

static void *
wifi_calloc_wrapper(size_t n, size_t size)
{
	return(esp_shim_calloc(n, size));
}

static void *
wifi_zalloc_wrapper(size_t size)
{
	return(esp_shim_calloc(1U, size));
}

static uint32_t
get_free_heap_size_wrapper(void)
{
	return((uint32_t)esp_shim_heap_free_size());
}

/*
 *		イベント（esp_event_shim.cの最小実装へ）
 *
 *  【実施10】esp_event_post の宣言は IDF v6.1 の esp_event.h
 *  （esp_wifi.h 経由で本TUに取り込まれる）が供給する
 *  （esp_err_t esp_event_post(esp_event_base_t, int32_t, const void *,
 *   size_t, TickType_t)）。以前の hal では esp_event.h がこの宣言を
 *  持たず本ファイルでローカル extern していたが，IDF では宣言が衝突
 *  （const void * 対 void *）するため削除し，esp_event.h の宣言を使う。
 *  実体は esp_event_shim.c（C3・独立TU）が提供する。
 */
static int32_t
event_post_wrapper(const char *event_base, int32_t event_id,
				   void *event_data, size_t event_data_size,
				   uint32_t ticks_to_wait)
{
	return(esp_event_post(event_base, event_id, event_data,
						  event_data_size, ticks_to_wait));
}

/*
 *		電源・クロック・PHY
 */
static void
dport_access_stall_other_cpu_start_wrapper(void)
{
	/* シングルコア：不要 */
}

static void
dport_access_stall_other_cpu_end_wrapper(void)
{
	/* シングルコア：不要 */
}

static void
wifi_apb80m_request_wrapper(void)
{
	/* 省電力（auto sleep）非対応：不要 */
}

static void
wifi_apb80m_release_wrapper(void)
{
}

static void
phy_enable_wrapper(void)
{
	/*  ★根本原因修正（C6実施6/追記10からの移植）：MODEM_LPCON_CLK_CONF
	 *  (0x600af018)のWIFIPWR(bit0)/COEX(bit1)/I2C_MST(bit2)クロックを，
	 *  PHY較正（esp_phy_enable→register_chipv7_phyがregi2c経由でRFを
	 *  較正）の直前に確実に有効化する．C6ではJTAGでnative(受信OK)=0x7
	 *  vs ASP3=0x0の差分として特定・実機検証済みの根本原因修正．
	 *  MODEM_LPCON_CLK_CONF_REGはC5でもベースアドレス（0x600AF000）・
	 *  オフセット（+0x18）・ビット位置（bit0=WIFIPWR/bit1=COEX/
	 *  bit2=I2C_MST）ともC6と完全に同一であることをsoc/esp32c5/include/
	 *  modem/modem_lpcon_reg.hで確認済みのため，そのまま移植する
	 *  （docs/c5-port-design.md §9）．I2C_MSTが立っていないとregi2c
	 *  越しのRF較正が無応答で受信不能＝AP 0個になる．
	 *
	 *  【C6からの差分・非移植】C6版はさらに0x600af008
	 *  （MODEM_LPCON_COEX_LP_CLK_CONF_REG．C5でも同名・同オフセットで
	 *  実在するが「検証のため」の未確定の補助措置であり根本原因修正
	 *  ではない）と0x600af048（C6のヘッダには対応する名前付きレジスタ
	 *  が存在せず，実機JTAGの広域diffで見つかった未公開アドレスへの
	 *  書込み）を行っていた．C5では0x600af048はMODEM_LPCON_DCMEM_
	 *  VALID_3_REG（DCMEM有効性ビットマップ．LPクロックとは無関係な
	 *  別レジスタ．soc/esp32c5/include/modem/modem_lpcon_reg.hで確認）
	 *  に相当するため，C6の値0x314をそのまま書き込むのは意味的に誤り
	 *  うる．未検証の判別指標を転記しない方針（memory/
	 *  feedback_hardware_investigation_rigor.md）に従い，本ポートでは
	 *  この2行を移植しない．C5で受信不成立が再現した場合の実機investigation
	 *  候補としてのみ記録する（【実機確認待ち】）．
	 */
	*(volatile uint32_t *)0x600af018U = 0x7U;
	esp_phy_enable(PHY_MODEM_WIFI);
	phy_wifi_enable_set(1U);
}

static void
phy_disable_wrapper(void)
{
	phy_wifi_enable_set(0U);
	esp_phy_disable(PHY_MODEM_WIFI);
}

static int
read_mac_wrapper(uint8_t *mac, unsigned int type)
{
	return(esp_read_mac(mac, (int)type));
}

static void
wifi_reset_mac_wrapper(void)
{
	modem_clock_module_mac_reset(PERIPH_WIFI_MODULE);
}

/*
 *  Zephyr soc_hw_init()のmodem ICG設定に相当する初期化（C6側で
 *  「根本原因候補」として実装後，C6実機JTAG実測でRX不成立とは無関係な
 *  冗長設定と判明し無効化された経緯がある．下記wifi_clock_enable_wrapper
 *  参照）．C5へはレジスタアドレスのみ更新して移植する（実装自体は
 *  C6同様，呼び出さない＝無効化した状態を維持．C5固有の実機検証で
 *  必要性を再確認すること）．
 *
 *  【C5でのレジスタ差替え】pmu（0x600B0000）・modem_lpcon（0x600AF000）
 *  はC6と同一アドレス．**modem_sysconのみ0x600A9800→0x600A9C00へ
 *  変更**（C6から+0x400移動．soc/esp32c5/include/modem/reg_base.hの
 *  DR_REG_MODEM_SYSCON_BASEで確認済み．docs/c5-port-design.md §9）．
 *  C6の値をそのまま転記しないという方針に従い個別に確認した．
 */
static void
esp_shim_modem_icg_init(void)
{
	pmu_dev_t			*pmu = (pmu_dev_t *)0x600B0000U;
	modem_lpcon_dev_t	*lpcon = (modem_lpcon_dev_t *)0x600AF000U;
	modem_syscon_dev_t	*syscon = (modem_syscon_dev_t *)0x600A9C00U;	/* C6の0x600A9800から+0x400移動 */
	uint32_t			code_bit = 1U << 2;	/* BIT(PMU_HP_ICG_MODEM_CODE_ACTIVE=2) */

	pmu_ll_hp_set_icg_modem(pmu, PMU_MODE_HP_ACTIVE, 2U);
	modem_syscon_ll_set_modem_apb_icg_bitmap(syscon, code_bit);
	modem_lpcon_ll_set_i2c_master_icg_bitmap(lpcon, code_bit);
	modem_lpcon_ll_set_lp_apb_icg_bitmap(lpcon, code_bit);
	pmu_ll_imm_update_dig_icg_modem_code(pmu, true);
	pmu_ll_imm_update_dig_icg_switch(pmu, true);
}

/*
 *  PVT自動dbias調整＋チャージポンプの初期化（【実施21】候補Bの加算移植）
 *
 *  stock ESP-IDF v6.1はC5でCONFIG_ESP_ENABLE_PVT=y（Kconfig既定）であり，
 *  CPUクロックをPLL(160M/240M)へ切り替える度に
 *  esp_hw_support/port/esp32c5/rtc_clk.c → pmu_pvt.c の
 *  pvt_auto_dbias_init()＋charge_pump_init()＋pvt_func_enable(true)＋
 *  charge_pump_enable(true)を実行する（eFuse blk_version>=2が前提．
 *  DUT実測=3で成立）．ASP3 Direct BootはROM設定のクロックのまま起動する
 *  ためこの経路を一切通らず，実施21のJTAG A/B実測で
 *  「stock=PCR_PVT_MONITOR_CONF(0x600960B8) bit0=1・PVTブロック
 *  (0x60019000)設定済み＋動作中／ASP3=クロックゲート・全ゼロ」という
 *  再現差分（各2ブート）を確認した．PVTはHP系dbias（コア電圧バイアス）を
 *  動的補正する機構で，アナログ測定系（トーン自己ループバックのSAR ADC）
 *  への影響が仮説候補のため加算移植する（docs/c5-bringup.md実施21）．
 *
 *  実装はIDF v6.1 pmu_pvt.cの実行順を忠実に再現し，レジスタ値は
 *  同一個体のstock実測ダンプ（実施21）と照合済み：
 *    - PVT_DBIAS_CMD0/1/2の上位ビットはeFuse dbias_vol_gap由来の
 *      チップ固有値を含むが，同一個体のstock実測値(0x13024/0x13005/
 *      0x13427)を転記するため一致する（rtc.hのPVT_CMD0=0x24等の
 *      定数成分も照合済み）．
 *    - DELAY_LIMIT系(154/147/143)・PUMP_BITMAP(1<<22)・
 *      PUMP_CHANNEL_CODE(1<<27)・PVT_TARGET(0xffff)・CLK_DIV(1)も
 *      rtc.h定数とstock実測の両方に一致．
 *
 *  なお実施21のJTAG注入（+2.6s＝txcap探索窓の冒頭で同内容を書込み，
 *  PVT実動作を読み戻しで確認）では30秒観測で症状不変（done=0・
 *  生ADC=0）だった．本移植はstockと同じ「PHY較正開始前に有効」という
 *  タイミングでの因果検証（負なら候補B棄却の確定側の証拠）を兼ねる．
 */
static void
esp_shim_pvt_init(void)
{
	/*  eFuse blk_version（EFUSE_RD_MAC_SYS2_REG 0x600B484C：
	 *  major=bit[12:11]・minor=bit[10:8]，blk_version=major*100+minor）  */
	uint32_t	sys2 = *(volatile uint32_t *)0x600B484CU;
	uint32_t	blk_version = ((sys2 >> 11) & 0x3U) * 100U + ((sys2 >> 8) & 0x7U);
	volatile uint32_t	*pcr_pvt_conf = (volatile uint32_t *)0x600960B8U;	/* PCR_PVT_MONITOR_CONF */
	volatile uint32_t	*pcr_pvt_func = (volatile uint32_t *)0x600960BCU;	/* PCR_PVT_MONITOR_FUNC_CLK_CONF */
	volatile uint32_t	*pmu_hp_reg0 = (volatile uint32_t *)0x600B0028U;	/* PMU_HP_ACTIVE_HP_REGULATOR0 */

