exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/wifi/esp_wifi_adapter.c
	if (blk_version < 2U) {
		return;		/* stockと同条件：PVT未サポートeFuse */
	}

	/*  --- pvt_auto_dbias_init() 相当 ---  */
	*pcr_pvt_conf |= (1U << 1);					/* RST_EN（リセットパルス） */
	*pcr_pvt_conf &= ~(1U << 1);
	*pcr_pvt_conf |= (1U << 0);					/* CLK_EN */
	*pcr_pvt_func |= (1U << 22);				/* FUNC_CLK_EN */
	*(volatile uint32_t *)0x60019064U = 0x7fff8000U;	/* DBIAS_TIMER：EN=0・TARGET=0xffff */
	esp_rom_delay_us(1U);
	*(volatile uint32_t *)0x60019034U = 0x42960400U;	/* DBIAS_CHANNEL_SEL0（monitor cell選択） */
	*(volatile uint32_t *)0x60019038U = 0x80000000U;	/* DBIAS_CHANNEL_SEL1 */
	*(volatile uint32_t *)0x6001903CU = 0x00013e80U;	/* CHANNEL0_SEL（フィルタ閾値） */
	*(volatile uint32_t *)0x60019040U = 0x00013e80U;	/* CHANNEL1_SEL */
	*(volatile uint32_t *)0x60019044U = 0x00010000U;	/* CHANNEL2_SEL */
	*(volatile uint32_t *)0x60019050U = 0x00013024U;	/* DBIAS_CMD0（調整特性＋lp/hp gap） */
	*(volatile uint32_t *)0x60019054U = 0x00013005U;	/* DBIAS_CMD1 */
	*(volatile uint32_t *)0x60019058U = 0x00013427U;	/* DBIAS_CMD2 */
	*pcr_pvt_func = (*pcr_pvt_func & ~0xFU) | 0x1U;		/* FUNC_CLK_DIV_NUM=1 */
	*pcr_pvt_func |= (1U << 20);				/* FUNC_CLK_SEL */
	*(volatile uint32_t *)0x600190D8U = 154U << 2;	/* SITE2_UNIT0_VT1：電圧高判定閾値 */
	*(volatile uint32_t *)0x600190DCU = 147U << 2;	/* SITE2_UNIT1_VT1：電圧低判定閾値 */
	*(volatile uint32_t *)0x600190E0U = 143U << 2;	/* SITE2_UNIT2_VT1：チャージポンプ閾値 */

	/*  --- charge_pump_init() 相当 ---  */
	*(volatile uint32_t *)0x6001902CU = 0x08000000U;	/* PMUP_CHANNEL_CFG：code0=1 */
	*(volatile uint32_t *)0x60019014U = 1U << 22;		/* PMUP_BITMAP_LOW0 */
	/*  PMUP_DRV_CFG：PUMP_DRV0=0（フィールドS=27）＝書込み不要  */

	/*  --- pvt_func_enable(true) 相当 ---  */
	*pmu_hp_reg0 |= (1U << 3);					/* DIG_DBIAS_INIT（較正開始） */
	*pcr_pvt_func |= (1U << 22);
	*pcr_pvt_conf |= (1U << 0);
	*(volatile uint32_t *)0x60019030U |= (1U << 8);		/* CLK_CFG：MONITOR_CLK_PVT_EN */
	*(volatile uint32_t *)0x600190D8U |= (1U << 0);		/* SITE2_UNIT0_VT1：MONITOR_EN */
	esp_rom_delay_us(10U);
	*pmu_hp_reg0 &= ~(1U << 14);				/* DIG_REGULATOR0_DBIAS_SEL=0（dbias制御をPVTへ移譲） */
	*pmu_hp_reg0 &= ~(1U << 3);					/* DIG_DBIAS_INIT解除 */
	*(volatile uint32_t *)0x60019064U |= (1U << 31);	/* DBIAS_TIMER：EN（自動dbias開始） */
	esp_rom_delay_us(50U);

	/*  --- charge_pump_enable(true) 相当 ---  */
	*(volatile uint32_t *)0x60019028U |= (1U << 9);		/* PMUP_DRV_CFG：PUMP_EN */

	/*  pmu_init()はPVT有効化後に1msの安定待ちを置く  */
	esp_rom_delay_us(1000U);
}

/*
 *  PMU HP_ACTIVEバイアス生成器起動＋WIFI電源ドメインのforce→FSM委譲
 *  （【実施22】決定実験Cのbefore-PHY移植）
 *
 *  実施22のJTAG A/B実測（PMU HP_ACTIVEバンク5レジスタの4-way比較，
 *  stock×2・ASP3×2）で，PMU_HP_ACTIVE_DIG_POWER/HP_REGULATOR1は差分なし，
 *  HP_REGULATOR0の差分は既に実施21でPVT/dbias軸として因果棄却済みだが，
 *  残り2件が実施11〜21のどのラウンドでも一度も実測されていなかった
 *  新規差分と判明した：
 *    - PMU_HP_ACTIVE_BIAS（0x600B0018）：stock=0x02000000（XPD_BIAS=1，
 *      HP_ACTIVEモードのアナログバイアス生成器を明示起動）／
 *      ASP3=0x00000000（POR既定のまま＝未起動）。
 *      hal/components/esp_hw_support/port/esp32c5/pmu_param.c:212の
 *      PMU_HP_ACTIVE_ANALOG_CONFIG_DEFAULT()で`.bias.xpd_bias = 1`と
 *      確定．stockのpmu_hp_system_init(PMU_MODE_HP_ACTIVE, ...)が
 *      設定する．ASP3はこの呼出し自体がゼロ行．
 *    - PMU_POWER_PD_HPWIFI_CNTL（0x600B0108）：stock=0x00000000
 *      （FORCE_PU/FORCE_NO_RESET/FORCE_NO_ISO等の強制ビットを全解除し
 *      HW電源シーケンサFSMへ委譲）／ASP3=0x0000001C（POR既定のまま＝
 *      FORCE_PU=1・FORCE_NO_RESET=1・FORCE_NO_ISO=1で静的固定）。
 *      hal/.../pmu_init.c:145-152のpmu_power_domain_force_default()相当が
 *      4電源ドメイン（HPWIFI含む）を順に「force解除→FSM委譲」させる．
 *      ASP3はこの遷移を一度も経験していない＝WIFI電源ドメインが
 *      POR以来ずっと静的forceのまま（動的な電源シーケンス・内部リセット
 *      パルスを一度も経ていない可能性）．
 *
 *  両レジスタともプレーンなR/Wビットフィールドでトリガ/ラッチ機構は
 *  無い（pmu_ll.hのpmu_ll_hp_set_bias_xpd/pmu_ll_hp_set_power_force_*系に
 *  update系呼出しは存在しない）．
 *
 *  実施22はまずASP3がPHY較正の無限リトライループに入った後（mid-hang）
 *  にJTAGで同値を注入し，読み戻しで注入成立を確認した上で30秒観測したが
 *  症状不変だった（組合せ・単独とも）．ただしXPD_BIASはアナログバイアス
 *  基準点そのものであり，較正チェーンが起動時に一度だけ基準点を
 *  ラッチする設計であれば mid-hang注入は原理的に無力（実施21候補Aと
 *  同型の限界，advisorレビュー指摘）．本移植はstockと同じ
 *  「PHY較正開始前」タイミングでの因果検証を兼ねる．
 */
static void
esp_shim_hpactive_bias_init(void)
{
	volatile uint32_t	*pmu_bias = (volatile uint32_t *)0x600B0018U;	/* PMU_HP_ACTIVE_BIAS */
	volatile uint32_t	*pmu_pd_hpwifi = (volatile uint32_t *)0x600B0108U;	/* PMU_POWER_PD_HPWIFI_CNTL */

	*pmu_bias = 0x02000000U;		/* XPD_BIAS=1（bit25）：HP_ACTIVEアナログバイアス生成器起動 */
	*pmu_pd_hpwifi = 0x00000000U;	/* force全解除：WIFI電源ドメインをHW FSM委譲へ */
}

/*
 *  【実施23】残余(1)：PMU_HP_ACTIVE_HP_CK_POWER（BBPLL/BB-I2Cアナログ電源）
 *
 *  実施21/22でHP_ACTIVEバンクの一部（BIAS/HP_REGULATOR0/PD_HPWIFI_CNTL）を
 *  比較・移植済みだったが，同バンクの`HP_CK_POWER`（`0x600B0014`，
 *  `pmu_hp_system_init()`のclk_power.val書込み先，`pmu_hp_clk_power_reg_t`
 *  ＝`xpd_bb_i2c`(bit28)・`xpd_bbpll_i2c`(bit29)・`xpd_bbpll`(bit30)）は
 *  実施11〜22のどのラウンドでも実測されていなかった．
 *
 *  実施23のJTAG A/B実測（同一個体，stock×2・ASP3×2）：
 *    stock=0x70000000（xpd_bb_i2c=1・xpd_bbpll_i2c=1・xpd_bbpll=1，
 *    `pmu_param.c`の`PMU_HP_ACTIVE_POWER_CONFIG_DEFAULT().clk_power`と一致）／
 *    ASP3=0x00000000（POR既定のまま＝BBPLL・BB I2Cのアナログ電源が
 *    一度も明示起動されていない）。
 *
 *  BBPLL（ベースバンドPLL）とBB I2C（ベースバンド内部レジスタバス）は
 *  トーン自己ループバック測定が使うBB内部ADC（`MODEM0+0x81C..0x828`）と
 *  同じアナログ/ミックスシグナル領域に属し，実施11〜22で見つかった
 *  どの差分よりもRF/BBアナログ機序への近さが高い．HP_ACTIVEバンクは
 *  Direct Boot開始以来ずっとこのモードのまま（light-sleep等のモード遷移が
 *  一度もない）ため，このバンクの値は現在も生きて反映されている
 *  （HP_MODEM/HP_SLEEPバンクとは異なり「休止中の設定」ではない）。
 *
 *  プレーンなR/Wビットフィールドでトリガ/ラッチ機構は無い
 *  （`pmu_ll_hp_set_clk_power()`はimm-update呼出しを伴わない）。
 *  最優先候補として単体で先に因果検証する（他の残余レジスタ群は
 *  実施23の次段でまとめて移植・検証）．
 */
static void
esp_shim_hpactive_ckpower_init(void)
{
	volatile uint32_t	*pmu_ck_power = (volatile uint32_t *)0x600B0014U;	/* PMU_HP_ACTIVE_HP_CK_POWER */

	*pmu_ck_power = 0x70000000U;	/* xpd_bb_i2c=1(bit28)/xpd_bbpll_i2c=1(bit29)/xpd_bbpll=1(bit30) */
}

/*
 *  【実施23】残余(2)：pmu_hp_system_init()のHP_ACTIVEバンクに残る
 *  低確度候補群＋pmu_power_domain_force_default()の未移植3ドメインを
 *  まとめて移植する（実施23のJTAG全域ダンプで新規に見つかったが，
 *  いずれも「現在到達しないモード遷移専用の設定」または「実施22で
 *  棄却済みPD_HPWIFIと同型のforce解除（他ドメイン）」であり，
 *  個別に単体因果検証するほどの機序的優先度は無いと判断し1件として
 *  まとめる——残余(1)のCK_POWERのみ単体検証済み）：
 *
 *    - `PMU_HP_ACTIVE_SYSCLK`（`0x600B0024`）：stock=0x08000000
 *      （icg_sysclk_en=1のみ）／ASP3=0x00000000。システムクロックICG
 *      バイパスの有効化ビットで，実施13のicg_modemと同系統だが対象が
 *      sysclk全体のICGである点が異なる。
 *    - `PMU_HP_ACTIVE_BACKUP`/`BACKUP_CLK`（`0x600B001C`/`0x600B0020`）：
 *      HP_SLEEP→ACTIVE・HP_MODEM→ACTIVEのregdma retention設定。
 *      ASP3はHP_SLEEP/HP_MODEMへ一度も遷移しない（light-sleep等の
 *      電源管理を一切呼ばない）ため，この設定が現在参照される経路は
 *      無いと考えられる（機序的に最も疑わしくない）。
 *    - `PMU_POWER_PD_TOP_CNTL`/`PD_HPAON_CNTL`/`PD_HPCPU_CNTL`
 *      （`0xf8`/`0xfc`/`0x100`）：`pmu_power_domain_force_default()`が
 *      force解除する4ドメイン（実施22はWIFIのみ移植・棄却）のうち
 *      残り3ドメイン。stock=0x00000000（force全解除）／ASP3=0x0000001c
 *      （POR既定のまま静的force）。
 *    - `PMU_POWER_PD_LPPERI_CNTL`（`0x10c`）：同関数のLP側force解除。
 *      stock=0x00000000／ASP3=0x0000001c。
 *
 *  いずれもプレーンR/Wでトリガ/ラッチ機構は無い。値は同一個体の
 *  stock実測（実施23）をそのまま転記する。
 */
static void
esp_shim_hpactive_residual2_init(void)
{
	volatile uint32_t	*pmu_sysclk    = (volatile uint32_t *)0x600B0024U;	/* PMU_HP_ACTIVE_SYSCLK */
	volatile uint32_t	*pmu_backup    = (volatile uint32_t *)0x600B001CU;	/* PMU_HP_ACTIVE_BACKUP */
	volatile uint32_t	*pmu_backupclk = (volatile uint32_t *)0x600B0020U;	/* PMU_HP_ACTIVE_BACKUP_CLK */
#if 0	/* 【実施23 bisection】PD_TOP/HPAON/HPCPU/LPPERI force解除を有効にした
	 * ビルドでJTAG単発halt(+9.9/12/13s)が11連続でPHYハングループ
	 * （0x42026000-0x4202a000）に到達できず，毎回dispatcher_1近傍
	 * （0x420217xx-0x420218xx）に着地する新規の停滞パターンを確認した
	 * （それ以前のCK_POWER単体ビルドでは同方式で確実に到達できていた）。
	 * 「悪化したら即revert」の方針に従い，最も疑わしい（CPU/TOP電源
	 * ドメインという影響範囲の大きさから）本ブロックを一時的に無効化し，
	 * 単独のビセクションでこの停滞の原因かどうかを切り分ける
	 * （docs/c5-bringup.md 実施23参照）。因果確認までは残置し，コードは
	 * ツリーからは削除しない。 */
	volatile uint32_t	*pmu_pd_top    = (volatile uint32_t *)0x600B00F8U;	/* PMU_POWER_PD_TOP_CNTL */
	volatile uint32_t	*pmu_pd_hpaon  = (volatile uint32_t *)0x600B00FCU;	/* PMU_POWER_PD_HPAON_CNTL */
	volatile uint32_t	*pmu_pd_hpcpu  = (volatile uint32_t *)0x600B0100U;	/* PMU_POWER_PD_HPCPU_CNTL */
	volatile uint32_t	*pmu_pd_lpperi = (volatile uint32_t *)0x600B010CU;	/* PMU_POWER_PD_LPPERI_CNTL */
#endif

	*pmu_sysclk    = 0x08000000U;	/* icg_sysclk_en=1(bit27) */
	*pmu_backup    = 0x010200a0U;	/* stock実測値（実施23）をそのまま転記 */
	*pmu_backupclk = 0xffffffffU;	/* backup_clk：全ビットicgバイパス（stock/デフォルトと同一） */
#if 0
	*pmu_pd_top    = 0x00000000U;	/* force全解除 */
	*pmu_pd_hpaon  = 0x00000000U;	/* force全解除 */
	*pmu_pd_hpcpu  = 0x00000000U;	/* force全解除 */
	*pmu_pd_lpperi = 0x00000000U;	/* force全解除 */
#endif
}

