exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/wifi/esp_wifi_adapter.c
/*
 *  【実施23】pmu_lp_system_init()の未移植分（LP_ACTIVE/LP_SLEEPバンク）
 *
 *  実施23のJTAG全域ダンプで新規に見つかった差分：
 *    - `PMU_HP_SLEEP_LP_REGULATOR0`（`0x600B009C`＝`lp_sys[LP_ACTIVE]
 *      .regulator0`，LPドメイン電圧レギュレータのdbias/xpd）：
 *      stock=0xe8400000／ASP3=0xc6600000。LP_ACTIVEは（ASP3がlight-sleep等の
 *      電源管理を一切呼ばないため）Direct Boot開始以来ずっと「現在有効な」
 *      バンクであり，実施21のHP側dbias（PVT）軸と同型だが対象がLPドメイン
 *      という点で新規（実施21候補Bはこの軸を棄却済みだがLP側は未検証）。
 *    - `PMU_LP_SLEEP_LP_REGULATOR0`/`XTAL`/`LP_CK_POWER`/`BIAS`
 *      （`0x600B00B4`/`0xBC`/`0xC4`/`0xC8`）：LP_SLEEPバンク（ASP3が
 *      一度も遷移しないモード専用の設定）。HP_MODEM/HP_SLEEPバンクと
 *      同種の理由で現在は不活性と考えられるが，`pmu_lp_system_init()`の
 *      パリティとして移植する。
 *
 *  ★注意：実施23のPD_TOP/HPAON/HPCPU force解除でJTAG単発halt法が
 *  ブートリーチャビリティを悪化させた前例があるため，本関数もCPU/TOP等の
 *  広域ドメイン制御を含まない（LPドメインのレギュレータ/クロック電源の
 *  プレーンR/Wのみ）ことを確認した上で適用する。
 */
static void
esp_shim_lpsystem_init(void)
{
	volatile uint32_t	*lp_active_reg0 = (volatile uint32_t *)0x600B009CU;	/* LP_ACTIVE.REGULATOR0 */
	volatile uint32_t	*lp_sleep_reg0  = (volatile uint32_t *)0x600B00B4U;	/* LP_SLEEP.REGULATOR0 */
	volatile uint32_t	*lp_sleep_xtal  = (volatile uint32_t *)0x600B00BCU;	/* LP_SLEEP.XTAL */
	volatile uint32_t	*lp_sleep_ck    = (volatile uint32_t *)0x600B00C4U;	/* LP_SLEEP.CK_POWER */
	volatile uint32_t	*lp_sleep_bias  = (volatile uint32_t *)0x600B00C8U;	/* LP_SLEEP.BIAS */

	*lp_active_reg0 = 0xe8400000U;	/* stock実測値（実施23）をそのまま転記 */
	*lp_sleep_reg0  = 0x60400000U;
	*lp_sleep_xtal  = 0x00000000U;
	*lp_sleep_ck    = 0x00000000U;
	*lp_sleep_bias  = 0xc0000000U;
}

static void
wifi_clock_enable_wrapper(void)
{
	static bool_t	lpclk_selected = false;

	/*  【実施13】C6ではesp_shim_modem_icg_init()はJTAG実測で冗長と判明
	 *  （clk_conf_power_st=0x66660000は既にnative一致＝modem_clockが
	 *  設定）していたため，C5でも暫定的に踏襲して無効化し，
	 *  「C5は未検証（【実機確認待ち】）」と明記していた．**C5実機の
	 *  JTAG実測でこの踏襲が誤りと判明したため有効化する**．
	 *
	 *  C5実測：PMU hp_sys[HP_ACTIVE].icg_modem.code（0x600B000C
	 *  bit31:30）がDirect Bootでは0のまま残る．一方，
	 *  MODEM_SYSCON_CLK_CONF_POWER_ST（0x600A9C0C）のCLK_WIFI_ST_MAP
	 *  ＝0x6＝BIT(1)|BIT(2)であり，ICGコード0はこのマップに含まれない．
	 *  そのためCLK_CONF1（0x600A9C14）のCLK_WIFIBB_*_EN群が全て1でも
	 *  **WIFIBBクロックはICGでゲートされたまま**になり，BBレジスタ
	 *  ブロック（MODEM0＝0x600A0000）への書込みが一切効かない．
	 *  結果，PHY較正のphy_iq_est_enable_new()が起動ビット（BB+0x450
	 *  bit1）を立てられず，完了ビット（BB+0x47C bit16）が永久に
	 *  立たない＝無限リトライループ（実施12で発見したハング）．
	 *
	 *  A/B/A/B反証実験（FORCE_ON=0・ST_MAP不変のまま，icg_modem.code
	 *  のみ0↔2をトグルし，都度BBレジスタへの書込み成否を確認）で
	 *  因果を確認済み：code=0→書込み無視，code=2→書込み成立．
	 *  なお適用にはPMUのimmediate updateパルス2本
	 *  （PMU_IMM_MODEM_ICG_REG=0x600B00DC bit31＝update_dig_icg_modem_en，
	 *  PMU_IMM_SLEEP_SYSCLK_REG=0x600B00D0 bit28＝update_dig_icg_switch）
	 *  の**両方**が必要（codeを書くだけでは反映されない．片方だけ
	 *  パルスした際は書込みが効かないことも実測で確認）．
	 *  詳細は docs/c5-bringup.md 実施13．
	 */
	esp_shim_modem_icg_init();

	/*
	 *  esp_perip_clk_init()（esp-hal-3rdpartyのesp_system/port/soc/
	 *  <chip>/clk.c．C6ではesp32c6/clk.c，C5では対応するesp32c5/clk.c
	 *  相当）が通常起動（第2段ブートローダ経由）で行うWi-Fi低電力
	 *  クロックソースの選択をここで代替する．Direct Bootではこの関数
	 *  自体が一切呼ばれないため，modem_clock_module_enable(PERIPH_WIFI_
	 *  MODULE)（wifi_module_enable経由）だけではWIFIPWRクロック
	 *  ドメイン（modem_lpcon.clk_conf.clk_wifipwr_en＝
	 *  DR_REG_MODEM_LPCON_BASE(0x600af000)+0x18のbit0．C5でも同一
	 *  アドレス／ビット位置）が有効化されない．これは
	 *  `MODEM_CLOCK_DOMAIN_WIFI`とは別系統のクロックゲートである．
	 *  C6はJTAGで実機比較して確認済みの根本原因修正（本関数を無効化
	 *  するとclk_wifipwr_en=0に留まり，有効化すると1へ一致．ただし
	 *  この修正単独ではC6の「AP 0個」問題は解消しなかった＝別要因が
	 *  残っていた．docs/wifi-shim-c6.md「実施6」参照）。C5でも
	 *  Direct Bootが同じ経路（esp_perip_clk_init相当を一切呼ばない）を
	 *  取ることは設計上確実なため同じ理由で必要と判断し移植するが，
	 *  clk_wifipwr_enが実際に0のまま残ることをJTAGで実測してはいない
	 *  （【実機確認待ち】）。
	 */
	if (!lpclk_selected) {
		/*  【実施21】候補B加算移植：stockがクロック切替時（＝PHY較正より
		 *  前）に行うPVT自動dbias＋チャージポンプ有効化を，Wi-Fi初期化の
		 *  一度きりのこの時点（regi2c有効化・phy_enableより前）で代替する  */
		esp_shim_pvt_init();

		/*  【実施22】決定実験Cのbefore-PHY移植：PMU HP_ACTIVEバイアス
		 *  生成器起動＋WIFI電源ドメインのforce→FSM委譲を同じ時点で代替する  */
		esp_shim_hpactive_bias_init();

		/*  【実施23】残余(1)：BBPLL/BB-I2Cアナログ電源起動を同じ時点で代替する  */
		esp_shim_hpactive_ckpower_init();

		/*  【実施23】残余(2)：SYSCLK ICG・retention・PD_TOP/HPAON/HPCPU/LPPERI
		 *  force解除を同じ時点で代替する  */
		esp_shim_hpactive_residual2_init();

		/*  【実施23】pmu_lp_system_init()の未移植分（LP_ACTIVE/LP_SLEEPバンク）
		 *  を同じ時点で代替する  */
		esp_shim_lpsystem_init();

		modem_clock_deselect_all_module_lp_clock_source();
		modem_clock_select_lp_clock_source(PERIPH_WIFI_MODULE,
											MODEM_CLOCK_LPCLK_SRC_RC_SLOW, 0U);

		/*
		 *  bootloader_hardware_init()（bootloader_support/src/<chip>/
		 *  bootloader_<chip>.c．C6ではesp32c6版）が第2段ブートローダ
		 *  内で行う「アナログI2Cマスタクロックを常時有効化」をここで
		 *  代替する．Direct Bootではブートローダ自体が動かないため，
		 *  modem_lpcon.clk_conf.clk_i2c_mst_en（DR_REG_MODEM_LPCON_BASE
		 *  (0x600af000)+0x18のbit2．clk_wifipwr_en=bit0とは別ビット．
		 *  C5でも同一アドレス／ビット位置）が一度も立たない．この
		 *  ビットはregi2c（RFシンセサイザ/PA/LNA/バイアスの内部
		 *  アナログ較正バス）の前提クロックで，PHYブロブは
		 *  esp_rom_regi2c_read/write（ROM関数）をこの前提の下で直接
		 *  呼ぶ．未有効化のままだとregi2c越しの較正（BBPLL/TXRF/BIAS
		 *  等）が無応答または不定値のまま進み，TX/RXとも電波が出ない
		 *  （C6でのsniffer実機観測で確認済み．docs/wifi-shim-c6.md
		 *  参照．C5では同種の症状が起きるかを含めて実機確認待ち）。
		 */
		_regi2c_ctrl_ll_master_enable_clock(true);
		regi2c_ctrl_ll_master_configure_clock();

		lpclk_selected = true;
	}

	wifi_module_enable();

	/*  ★根本原因修正（C6実施6/追記10からの移植）：wifi_module_enable()
	 *  後もMODEM_LPCON_CLK_CONF(0x600af018)のWIFIPWR/COEX/I2C_MSTクロック
	 *  (bit0/1/2)を明示的に有効化する．C6は_regi2c_ctrl_ll_master_enable_
	 *  clock等だけでは実機で0x0のまま（JTAG実測）＝受信不能だったため，
	 *  この明示的な再アサートが必要だった．レジスタアドレス・ビット
	 *  位置がC5でも同一であることを確認済みのためそのまま移植する
	 *  （phy_enable_wrapper側のコメントも参照）。 */
	*(volatile uint32_t *)0x600af018U = 0x7U;
}

static void
wifi_clock_disable_wrapper(void)
{
	wifi_module_disable();
}

static void
wifi_rtc_enable_iso_wrapper(void)
{
	/* MAC/BBパワーダウン非対応：不要 */
}

static void
wifi_rtc_disable_iso_wrapper(void)
{
}

static uint32_t
slowclk_cal_get_wrapper(void)
{
	/*
	 *  RTCスローклックの較正値（Q13固定小数点）．
	 *  RTC_CNTL_STORE1に格納された値を返す（ROM/ブート時の設定を流用）．
	 *  未設定（0）の場合は150kHz RCの公称値を返す．
	 */
	/*  LP_AON_STORE1_REG（C3のRTC_CNTL_STORE1相当．DR_REG_LP_AON_BASE
	 *  (0x600B1000)+0x4）．C6はRTC_CNTL→LP_AON等へ分割・改称された．
	 *  C5もLP_AONベース（0x600B1000）・STORE1オフセット（+0x4）とも
	 *  C6と同一であることをsoc/esp32c5/register/soc/lp_aon_reg.hで
	 *  確認済み（docs/c5-port-design.md §9）．  */
	uint32_t cal = sil_rew_mem((void *)0x600B1004U);	/* LP_AON_STORE1 */
	if (cal == 0U) {
		cal = (uint32_t)((1000000ULL << 13) / 150000U);
	}
	return(cal);
}

