exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/wifi/esp_wifi_adapter.c
/*
 *		タイマ
 */
static void
timer_arm_wrapper(void *timer, uint32_t tmout, bool repeat)
{
	esp_shim_timer_arm_us(timer, tmout * 1000U, repeat);
}

static void
timer_arm_us_wrapper(void *ptimer, uint32_t us, bool repeat)
{
	esp_shim_timer_arm_us(ptimer, us, repeat);
}

static void
timer_disarm_wrapper(void *timer)
{
	esp_shim_timer_disarm(timer);
}

static void
timer_done_wrapper(void *ptimer)
{
	esp_shim_timer_done(ptimer);
}

static void
timer_setfn_wrapper(void *ptimer, void *pfunction, void *parg)
{
	esp_shim_timer_setfn(ptimer, (void (*)(void *))pfunction, parg);
}

static int64_t
esp_timer_get_time_wrapper(void)
{
	return(esp_shim_time_us());
}

/*
 *		NVS（NuttXと同じく未実装）
 */
static int
nvs_set_i8_wrapper(uint32_t handle, const char *key, int8_t value)
{
	(void) handle; (void) key; (void) value;
	return(-1);
}

static int
nvs_get_i8_wrapper(uint32_t handle, const char *key, int8_t *out_value)
{
	(void) handle; (void) key; (void) out_value;
	return(-1);
}

static int
nvs_set_u8_wrapper(uint32_t handle, const char *key, uint8_t value)
{
	(void) handle; (void) key; (void) value;
	return(-1);
}

static int
nvs_get_u8_wrapper(uint32_t handle, const char *key, uint8_t *out_value)
{
	(void) handle; (void) key; (void) out_value;
	return(-1);
}

static int
nvs_set_u16_wrapper(uint32_t handle, const char *key, uint16_t value)
{
	(void) handle; (void) key; (void) value;
	return(-1);
}

static int
nvs_get_u16_wrapper(uint32_t handle, const char *key, uint16_t *out_value)
{
	(void) handle; (void) key; (void) out_value;
	return(-1);
}

static int
nvs_open_wrapper(const char *name, unsigned int open_mode,
				 uint32_t *out_handle)
{
	(void) name; (void) open_mode; (void) out_handle;
	return(-1);
}

static void
nvs_close_wrapper(uint32_t handle)
{
	(void) handle;
}

static int
nvs_commit_wrapper(uint32_t handle)
{
	(void) handle;
	return(-1);
}

static int
nvs_set_blob_wrapper(uint32_t handle, const char *key, const void *value,
					 size_t length)
{
	(void) handle; (void) key; (void) value; (void) length;
	return(-1);
}

static int
nvs_get_blob_wrapper(uint32_t handle, const char *key, void *out_value,
					 size_t *length)
{
	(void) handle; (void) key; (void) out_value; (void) length;
	return(-1);
}

static int
nvs_erase_key_wrapper(uint32_t handle, const char *key)
{
	(void) handle; (void) key;
	return(-1);
}

/*
 *		乱数・時刻
 */
static uint32_t
rand_wrapper(void)
{
	return(esp_shim_random());
}

static int
get_random_wrapper(uint8_t *buf, size_t len)
{
	size_t	i;

	for (i = 0U; i < len; i++) {
		buf[i] = (uint8_t)(esp_shim_random() & 0xFFU);
	}
	return(0);
}

static int
get_time_wrapper(void *t)
{
	struct {
		long	tv_sec;
		long	tv_usec;
	} *tv = t;
	int64_t	us = esp_shim_time_us();

	tv->tv_sec = (long)(us / 1000000);
	tv->tv_usec = (long)(us % 1000000);
	return(0);
}

static unsigned long
random_wrapper(void)
{
	return((unsigned long)esp_shim_random());
}

/*
 *		ログ
 */
static void
log_writev_wrapper(unsigned int level, const char *tag, const char *format,
				   va_list args)
{
	char	buf[128];

	(void) level;
	(void) tag;
	vsnprintf(buf, sizeof(buf), format, args);
	syslog(LOG_NOTICE, "%s", buf);
}

static void
log_write_wrapper(unsigned int level, const char *tag, const char *format, ...)
{
	va_list	args;

	va_start(args, format);
	log_writev_wrapper(level, tag, format, args);
	va_end(args);
}

static uint32_t
log_timestamp_wrapper(void)
{
	return((uint32_t)(esp_shim_time_us() / 1000));
}

/*
 *		coexistence（libcoexist.aへのパススルー）
 */
extern int coex_init(void);
extern void coex_deinit(void);
extern int coex_enable(void);
extern void coex_disable(void);
extern uint32_t coex_status_get(void);
extern void coex_condition_set(uint32_t type, bool dissatisfy);
extern int coex_wifi_request(uint32_t event, uint32_t latency,
							 uint32_t duration);
extern int coex_wifi_release(uint32_t event);
extern int coex_wifi_channel_set(uint8_t primary, uint8_t secondary);
extern int coex_event_duration_get(uint32_t event, uint32_t *duration);
extern int coex_pti_get(uint32_t event, uint8_t *pti);
extern void coex_schm_status_bit_clear(uint32_t type, uint32_t status);
extern void coex_schm_status_bit_set(uint32_t type, uint32_t status);
extern int coex_schm_interval_set(uint32_t interval);
extern uint32_t coex_schm_interval_get(void);
extern uint8_t coex_schm_curr_period_get(void);
extern void *coex_schm_curr_phase_get(void);
extern int coex_schm_process_restart(void);
extern int coex_schm_register_callback(int type, int (*cb)(int));
/*
 *  blob側の実シンボル名は coex_register_start_cb（末尾_callbackでは
 *  ない）．nm確認済み（hal/components/esp_coex/lib/esp32c3/
 *  libcoexist.a）．
 */
extern int coex_register_start_cb(int (*cb)(void));
extern int coex_schm_flexible_period_set(uint8_t period);
extern uint8_t coex_schm_flexible_period_get(void);
extern void *coex_schm_get_phase_by_idx(int idx);

/*
 *  【実施10】ESP-IDF v6.1（os_adapter 0x09）で wifi_osi_funcs_t に
 *  追加された sleep-retention / HE(AX) 系フィールドの no-op スタブ。
 *  scan 経路（PM/sleep 無効）では呼ばれない想定のため，まず無害な
 *  スタブ（0返し／何もしない）で ABI を満たす。scan が要求した場合の
 *  実装は後続（docs/c5-bringup.md）。v8 では未設定＝NULL のままだった
 *  C6/C5-gated の regdma/sleep_retention_find もここで安全側に埋める。
 */
static void regdma_link_set_write_wait_content_wrapper(void *link, uint32_t value, uint32_t mask)
{
	(void)link; (void)value; (void)mask;
}
static void *sleep_retention_find_link_by_id_wrapper(int id)
{
	(void)id;
	return NULL;
}
static int32_t wifi_bb_sleep_retention_attach_wrapper(void)
{
	return 0;
}
static int32_t wifi_bb_sleep_retention_detach_wrapper(void)
{
	return 0;
}
static int32_t wifi_mac_sleep_retention_attach_wrapper(void)
{
	return 0;
}
static int32_t wifi_mac_sleep_retention_detach_wrapper(void)
{
	return 0;
}
/*
 *  【実施12】_wifi_pm_sleep_lock_acquire/_wifi_pm_sleep_lock_release：
 *  v9のwifi_os_adapter.hでは，v8で削除した_wifi_apb80m_request/releaseと
 *  同じ構造体スロット（_dport_access_stall_other_cpu_end_wrapの直後，
 *  _phy_disableの直前）に位置する別フィールドとして存在する（削除では
 *  なく置換）。実施10のv9移行時，apb80m側の削除は正しく行ったが，この
 *  置換後継フィールドの追加が漏れていたためNULL関数ポインタのまま
 *  だった。本リポジトリはESP-IDFのPM（動的クロック/スリープ）サブ
 *  システムを実装しないため，他のPM/sleep-retention系フィールドと
 *  同じ方針でno-opスタブとする。
 */
static void wifi_pm_sleep_lock_acquire_wrapper(void)
{
}
static void wifi_pm_sleep_lock_release_wrapper(void)
{
}
#if CONFIG_SOC_WIFI_HE_SUPPORT
static bool wifi_disable_ac_ax_wrapper(void)
{
	return false;
}
#endif

